In [ ]:
#Extract
import pandas as pd 
df = pd.read_csv(r"C:\Users\Dhivakar\pipelines\orders.csv")
df

   order_id   product  quantity  unit_price
0       101       pen      10.0         5.0
1       102  notebook       NaN        20.0
2       103       pen       5.0         NaN
3       104    eraser       NaN         2.0

In [3]:
#Transform 
# Fill missing quantity and unit_price with default values (e.g., 1)
df['quantity'].fillna(1, inplace=True)
df['unit_price'].fillna(1, inplace = True)
df

C:\Users\Dhivakar\AppData\Local\Temp\ipykernel_9944\2761981923.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['quantity'].fillna(1, inplace=True)
C:\Users\Dhivakar\AppData\Local\Temp\ipykernel_9944\2761981923.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['unit_price'].fillna(1, inplace = True)

   order_id   product  quantity  unit_price
0       101       pen      10.0         5.0
1       102  notebook       1.0        20.0
2       103       pen       5.0         1.0
3       104    eraser       1.0         2.0

In [4]:
# Convert to integers (if needed)
df['quantity'] = df['quantity'].astype(int)
df['unit_price'] = df['unit_price'].astype(int)
df

   order_id   product  quantity  unit_price
0       101       pen        10           5
1       102  notebook         1          20
2       103       pen         5           1
3       104    eraser         1           2

In [ ]:
#Adding columns 
df['total_price'] = df['unit_price'] * df['quantity']
df

   order_id   product  quantity  unit_price  total_price
0       101       pen        10           5           50
1       102  notebook         1          20           20
2       103       pen         5           1            5
3       104    eraser         1           2            2

In [7]:
#Load 
df.to_csv('cleaned.csv', index = False)
print("ETL Process Completed! Cleaned file saved.")

ETL Process Completed! Cleaned file saved.

In [8]:
#Practice 2 with products data 
df.head(2)

   order_id   product  quantity  unit_price  total_price
0       101       pen        10           5           50
1       102  notebook         1          20           20

In [10]:
#Working with an API's 
#Extracting data from an API.

import requests 
import json

In [11]:
#API URL for weather in chennai
url = "https://api.open-meteo.com/v1/forecast?latitude=13.08&longitude=80.27&current_weather=true"
response = requests.get(url)

In [12]:
data = response.json()

In [13]:
data

{'latitude': 13.0,
 'longitude': 80.125,
 'generationtime_ms': 0.040531158447265625,
 'utc_offset_seconds': 0,
 'timezone': 'GMT',
 'timezone_abbreviation': 'GMT',
 'elevation': 10.0,
 'current_weather_units': {'time': 'iso8601',
  'interval': 'seconds',
  'temperature': '°C',
  'windspeed': 'km/h',
  'winddirection': '°',
  'is_day': '',
  'weathercode': 'wmo code'},
 'current_weather': {'time': '2025-06-21T07:45',
  'interval': 900,
  'temperature': 35.5,
  'windspeed': 11.5,
  'winddirection': 266,
  'is_day': 1,
  'weathercode': 3}}

In [14]:
weather = data['current_weather']
print("Weather Data Extracted:")
weather

Weather Data Extracted:

{'time': '2025-06-21T07:45',
 'interval': 900,
 'temperature': 35.5,
 'windspeed': 11.5,
 'winddirection': 266,
 'is_day': 1,
 'weathercode': 3}

In [16]:
#Practice 3 
st = pd.read_csv(r"C:\Users\Dhivakar\pipelines\students.csv")
st

      name  marks
0    Alice     92
1      Bob     76
2  Charlie     88
3    David     65
4     Esha     81

In [17]:
#Print students who scored above 80.
high_scores = st[st['marks'] > 80]
print("Students who scored more than 80 are:")
high_scores

Students who scored more than 80 are:

      name  marks
0    Alice     92
2  Charlie     88
4     Esha     81

In [19]:
#Create a new column "Grade"
def get_grade(marks):
    if marks > 90:
        return "A"
    elif marks > 80:
        return "B"
    else:
        return "C"
    
st['grade'] = st['marks'].apply(get_grade) 
st

      name  marks grade
0    Alice     92     A
1      Bob     76     C
2  Charlie     88     B
3    David     65     C
4     Esha     81     B

In [23]:
#Renaming a column
st.rename(columns = {'name' : 'student_name', 'marks' : 'student_marks', 'grade': 'Student_grade'}, inplace = True)
st

  student_name  student_marks Student_grade
0        Alice             92             A
1          Bob             76             C
2      Charlie             88             B
3        David             65             C
4         Esha             81             B

In [ ]:
#Change data type.
st['student_marks'] = st['student_marks'].astype(float)
st

  student_name  student_marks Student_grade
0        Alice           92.0             A
1          Bob           76.0             C
2      Charlie           88.0             B
3        David           65.0             C
4         Esha           81.0             B

In [28]:
#Group and Aggregate 
#count of students in each grade.
grade_summary = st.groupby('Student_grade')['student_name'].count().reset_index()
grade_summary.rename(columns = {'student_name': 'count'}, inplace = True)
grade_summary

  Student_grade  count
0             A      1
1             B      2
2             C      2

In [30]:
#Adding new column "status"
def status(marks):
    if marks > 45 : 
        return "Pass"
    else: 
        return "Fail"
st['student_status'] = st['student_marks'].apply(status)
st

  student_name  student_marks Student_grade student_status
0        Alice           92.0             A           Pass
1          Bob           76.0             C           Pass
2      Charlie           88.0             B           Pass
3        David           65.0             C           Pass
4         Esha           81.0             B           Pass

In [31]:
#Practice 5 
#Sample DataFrame to Load.
data = {
    'student_name': ['Alice', 'Bob', 'Charlie', 'David', 'Esha'],
    'marks': [92, 76, 88, 65, 81],
    'grade': ['A', 'B', 'B', 'C', 'B']
}
df = pd.DataFrame(data)
df

  student_name  marks grade
0        Alice     92     A
1          Bob     76     B
2      Charlie     88     B
3        David     65     C
4         Esha     81     B

In [38]:
import pyodbc

conn = pyodbc.connect(
    'DRIVER={SQL Server};'
    'SERVER=DESKTOP-29912U2\\MSSQLSERVER1;'
    'DATABASE=StudentDB;'
    'UID=sa;'
    'PWD=Dhiva@2003;'
)

cursor = conn.cursor()
print("Connected successfully!")

Connected successfully!

In [39]:
cursor.execute("""
Create Table Students ( 
        student_name varchar(100),
        marks int,
        grade char(1)
    )
""")
conn.commit()

In [40]:
#Insert Data from DataFrame to SQL Table.
for index, row in df.iterrows():
    cursor.execute(""" 
            Insert into students(student_name, marks, grade)
            Values(?, ?, ?)
        """, row['student_name'], row['marks'], row['grade']
    )

conn.commit()
print("Data loaded successfully into SSMS.")

Data loaded successfully into SSMS.

In [42]:
#updating and again loading to sql server
df['status'] = df['marks'].apply(lambda x: 'Pass' if x >= 40 else 'Fail')
df

  student_name  marks grade status
0        Alice     92     A   Pass
1          Bob     76     B   Pass
2      Charlie     88     B   Pass
3        David     65     C   Pass
4         Esha     81     B   Pass

In [43]:
cursor.execute("""
        Alter table students 
        Add status varchar(5)  
        """
)

conn.commit()

In [46]:
for index, row in df.iterrows():
    cursor.execute("""
        Update students Set Status = ? 
        Where student_name = ?
""", row['status'], row['student_name']
)

conn.commit()

print("Status column updated successfully")

Status column updated successfully

In [47]:
#practice 6 
#Building a new pipeline 
ws = pd.read_csv(r"C:\Users\Dhivakar\pipelines\weekly_scores.csv")
ws

  student_name  marks
0        Alice     92
1          Bob     76
2      Charlie     88
3        David     35
4         Esha     81

In [ ]:
#Add Grade
def get_grade(marks):
    if marks >= 90:
        return 'A'
    elif marks >= 75:
        return 'B'
    elif marks >= 60:
        return 'C' 
    else:
        return 'D'
    
ws['grade'] = ws['marks'].apply(get_grade)
ws

  student_name  marks grade
0        Alice     92     A
1          Bob     76     B
2      Charlie     88     B
3        David     35     D
4         Esha     81     B

In [50]:
#Add Pass or Fail 
ws['status'] = ws['marks'].apply(lambda x: 'Pass' if x >= 45 else 'Fail')
ws

  student_name  marks grade status
0        Alice     92     A   Pass
1          Bob     76     B   Pass
2      Charlie     88     B   Pass
3        David     35     D   Fail
4         Esha     81     B   Pass

In [52]:
#Now Finally Loading into MS SQL Server.
conn = pyodbc.connect(
    'DRIVER={SQL Server};'
    'SERVER=DESKTOP-29912U2\\MSSQLSERVER1;'
    'DATABASE=StudentDB;'
    'UID=sa;'
    'PWD=Dhiva@2003;'
)
cursor = conn.cursor()

In [53]:
cursor.execute("Delete from students")
conn.commit()

In [54]:
for index,row in df.iterrows():
    cursor.execute(""" 
         Insert into students(student_name, marks, grade, status)
         Values(?, ?, ?, ?)
    """, row['student_name'], row['marks'], row['grade'], row['status']          
    )

conn.commit()
print("ETL job completed successfully!!")

ETL job completed successfully!!